SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_cmu.h
/* Bit fields for CMU CLKEN0 */
#define _CMU_CLKEN0_RESETVALUE                  0x00000000UL                            /**< Default value for CMU_CLKEN0                */
#define _CMU_CLKEN0_MASK                        0xFFFFFFFFUL                            /**< Mask for CMU_CLKEN0                         */
#define CMU_CLKEN0_LDMA                         (0x1UL << 0)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_LDMA_SHIFT                  0                                       /**< Shift value for CMU_LDMA                    */
#define _CMU_CLKEN0_LDMA_MASK                   0x1UL                                   /**< Bit mask for CMU_LDMA                       */
#define _CMU_CLKEN0_LDMA_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_LDMA_DEFAULT                 (_CMU_CLKEN0_LDMA_DEFAULT << 0)         /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_LDMAXBAR                     (0x1UL << 1)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_LDMAXBAR_SHIFT              1                                       /**< Shift value for CMU_LDMAXBAR                */
#define _CMU_CLKEN0_LDMAXBAR_MASK               0x2UL                                   /**< Bit mask for CMU_LDMAXBAR                   */
#define _CMU_CLKEN0_LDMAXBAR_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_LDMAXBAR_DEFAULT             (_CMU_CLKEN0_LDMAXBAR_DEFAULT << 1)     /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_RADIOAES                     (0x1UL << 2)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_RADIOAES_SHIFT              2                                       /**< Shift value for CMU_RADIOAES                */
#define _CMU_CLKEN0_RADIOAES_MASK               0x4UL                                   /**< Bit mask for CMU_RADIOAES                   */
#define _CMU_CLKEN0_RADIOAES_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_RADIOAES_DEFAULT             (_CMU_CLKEN0_RADIOAES_DEFAULT << 2)     /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_GPCRC                        (0x1UL << 3)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_GPCRC_SHIFT                 3                                       /**< Shift value for CMU_GPCRC                   */
#define _CMU_CLKEN0_GPCRC_MASK                  0x8UL                                   /**< Bit mask for CMU_GPCRC                      */
#define _CMU_CLKEN0_GPCRC_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_GPCRC_DEFAULT                (_CMU_CLKEN0_GPCRC_DEFAULT << 3)        /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_TIMER0                       (0x1UL << 4)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_TIMER0_SHIFT                4                                       /**< Shift value for CMU_TIMER0                  */
#define _CMU_CLKEN0_TIMER0_MASK                 0x10UL                                  /**< Bit mask for CMU_TIMER0                     */
#define _CMU_CLKEN0_TIMER0_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_TIMER0_DEFAULT               (_CMU_CLKEN0_TIMER0_DEFAULT << 4)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_TIMER1                       (0x1UL << 5)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_TIMER1_SHIFT                5                                       /**< Shift value for CMU_TIMER1                  */
#define _CMU_CLKEN0_TIMER1_MASK                 0x20UL                                  /**< Bit mask for CMU_TIMER1                     */
#define _CMU_CLKEN0_TIMER1_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_TIMER1_DEFAULT               (_CMU_CLKEN0_TIMER1_DEFAULT << 5)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_TIMER2                       (0x1UL << 6)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_TIMER2_SHIFT                6                                       /**< Shift value for CMU_TIMER2                  */
#define _CMU_CLKEN0_TIMER2_MASK                 0x40UL                                  /**< Bit mask for CMU_TIMER2                     */
#define _CMU_CLKEN0_TIMER2_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_TIMER2_DEFAULT               (_CMU_CLKEN0_TIMER2_DEFAULT << 6)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_TIMER3                       (0x1UL << 7)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_TIMER3_SHIFT                7                                       /**< Shift value for CMU_TIMER3                  */
#define _CMU_CLKEN0_TIMER3_MASK                 0x80UL                                  /**< Bit mask for CMU_TIMER3                     */
#define _CMU_CLKEN0_TIMER3_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_TIMER3_DEFAULT               (_CMU_CLKEN0_TIMER3_DEFAULT << 7)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_TIMER4                       (0x1UL << 8)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_TIMER4_SHIFT                8                                       /**< Shift value for CMU_TIMER4                  */
#define _CMU_CLKEN0_TIMER4_MASK                 0x100UL                                 /**< Bit mask for CMU_TIMER4                     */
#define _CMU_CLKEN0_TIMER4_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_TIMER4_DEFAULT               (_CMU_CLKEN0_TIMER4_DEFAULT << 8)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_USART0                       (0x1UL << 9)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_USART0_SHIFT                9                                       /**< Shift value for CMU_USART0                  */
#define _CMU_CLKEN0_USART0_MASK                 0x200UL                                 /**< Bit mask for CMU_USART0                     */
#define _CMU_CLKEN0_USART0_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_USART0_DEFAULT               (_CMU_CLKEN0_USART0_DEFAULT << 9)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_IADC0                        (0x1UL << 10)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_IADC0_SHIFT                 10                                      /**< Shift value for CMU_IADC0                   */
#define _CMU_CLKEN0_IADC0_MASK                  0x400UL                                 /**< Bit mask for CMU_IADC0                      */
#define _CMU_CLKEN0_IADC0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_IADC0_DEFAULT                (_CMU_CLKEN0_IADC0_DEFAULT << 10)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_AMUXCP0                      (0x1UL << 11)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_AMUXCP0_SHIFT               11                                      /**< Shift value for CMU_AMUXCP0                 */
#define _CMU_CLKEN0_AMUXCP0_MASK                0x800UL                                 /**< Bit mask for CMU_AMUXCP0                    */
#define _CMU_CLKEN0_AMUXCP0_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_AMUXCP0_DEFAULT              (_CMU_CLKEN0_AMUXCP0_DEFAULT << 11)     /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_LETIMER0                     (0x1UL << 12)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_LETIMER0_SHIFT              12                                      /**< Shift value for CMU_LETIMER0                */
#define _CMU_CLKEN0_LETIMER0_MASK               0x1000UL                                /**< Bit mask for CMU_LETIMER0                   */
#define _CMU_CLKEN0_LETIMER0_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_LETIMER0_DEFAULT             (_CMU_CLKEN0_LETIMER0_DEFAULT << 12)    /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_WDOG0                        (0x1UL << 13)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_WDOG0_SHIFT                 13                                      /**< Shift value for CMU_WDOG0                   */
#define _CMU_CLKEN0_WDOG0_MASK                  0x2000UL                                /**< Bit mask for CMU_WDOG0                      */
#define _CMU_CLKEN0_WDOG0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_WDOG0_DEFAULT                (_CMU_CLKEN0_WDOG0_DEFAULT << 13)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_I2C0                         (0x1UL << 14)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_I2C0_SHIFT                  14                                      /**< Shift value for CMU_I2C0                    */
#define _CMU_CLKEN0_I2C0_MASK                   0x4000UL                                /**< Bit mask for CMU_I2C0                       */
#define _CMU_CLKEN0_I2C0_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_I2C0_DEFAULT                 (_CMU_CLKEN0_I2C0_DEFAULT << 14)        /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_I2C1                         (0x1UL << 15)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_I2C1_SHIFT                  15                                      /**< Shift value for CMU_I2C1                    */
#define _CMU_CLKEN0_I2C1_MASK                   0x8000UL                                /**< Bit mask for CMU_I2C1                       */
#define _CMU_CLKEN0_I2C1_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_I2C1_DEFAULT                 (_CMU_CLKEN0_I2C1_DEFAULT << 15)        /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_SYSCFG                       (0x1UL << 16)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_SYSCFG_SHIFT                16                                      /**< Shift value for CMU_SYSCFG                  */
#define _CMU_CLKEN0_SYSCFG_MASK                 0x10000UL                               /**< Bit mask for CMU_SYSCFG                     */
#define _CMU_CLKEN0_SYSCFG_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_SYSCFG_DEFAULT               (_CMU_CLKEN0_SYSCFG_DEFAULT << 16)      /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_DPLL0                        (0x1UL << 17)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_DPLL0_SHIFT                 17                                      /**< Shift value for CMU_DPLL0                   */
#define _CMU_CLKEN0_DPLL0_MASK                  0x20000UL                               /**< Bit mask for CMU_DPLL0                      */
#define _CMU_CLKEN0_DPLL0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_DPLL0_DEFAULT                (_CMU_CLKEN0_DPLL0_DEFAULT << 17)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_HFRCO0                       (0x1UL << 18)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_HFRCO0_SHIFT                18                                      /**< Shift value for CMU_HFRCO0                  */
#define _CMU_CLKEN0_HFRCO0_MASK                 0x40000UL                               /**< Bit mask for CMU_HFRCO0                     */
#define _CMU_CLKEN0_HFRCO0_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_HFRCO0_DEFAULT               (_CMU_CLKEN0_HFRCO0_DEFAULT << 18)      /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_HFRCOEM23                    (0x1UL << 19)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_HFRCOEM23_SHIFT             19                                      /**< Shift value for CMU_HFRCOEM23               */
#define _CMU_CLKEN0_HFRCOEM23_MASK              0x80000UL                               /**< Bit mask for CMU_HFRCOEM23                  */
#define _CMU_CLKEN0_HFRCOEM23_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_HFRCOEM23_DEFAULT            (_CMU_CLKEN0_HFRCOEM23_DEFAULT << 19)   /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_HFXO0                        (0x1UL << 20)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_HFXO0_SHIFT                 20                                      /**< Shift value for CMU_HFXO0                   */
#define _CMU_CLKEN0_HFXO0_MASK                  0x100000UL                              /**< Bit mask for CMU_HFXO0                      */
#define _CMU_CLKEN0_HFXO0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_HFXO0_DEFAULT                (_CMU_CLKEN0_HFXO0_DEFAULT << 20)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_FSRCO                        (0x1UL << 21)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_FSRCO_SHIFT                 21                                      /**< Shift value for CMU_FSRCO                   */
#define _CMU_CLKEN0_FSRCO_MASK                  0x200000UL                              /**< Bit mask for CMU_FSRCO                      */
#define _CMU_CLKEN0_FSRCO_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_FSRCO_DEFAULT                (_CMU_CLKEN0_FSRCO_DEFAULT << 21)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_LFRCO                        (0x1UL << 22)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_LFRCO_SHIFT                 22                                      /**< Shift value for CMU_LFRCO                   */
#define _CMU_CLKEN0_LFRCO_MASK                  0x400000UL                              /**< Bit mask for CMU_LFRCO                      */
#define _CMU_CLKEN0_LFRCO_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_LFRCO_DEFAULT                (_CMU_CLKEN0_LFRCO_DEFAULT << 22)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_LFXO                         (0x1UL << 23)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_LFXO_SHIFT                  23                                      /**< Shift value for CMU_LFXO                    */
#define _CMU_CLKEN0_LFXO_MASK                   0x800000UL                              /**< Bit mask for CMU_LFXO                       */
#define _CMU_CLKEN0_LFXO_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_LFXO_DEFAULT                 (_CMU_CLKEN0_LFXO_DEFAULT << 23)        /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_ULFRCO                       (0x1UL << 24)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_ULFRCO_SHIFT                24                                      /**< Shift value for CMU_ULFRCO                  */
#define _CMU_CLKEN0_ULFRCO_MASK                 0x1000000UL                             /**< Bit mask for CMU_ULFRCO                     */
#define _CMU_CLKEN0_ULFRCO_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_ULFRCO_DEFAULT               (_CMU_CLKEN0_ULFRCO_DEFAULT << 24)      /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_LESENSE                      (0x1UL << 25)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_LESENSE_SHIFT               25                                      /**< Shift value for CMU_LESENSE                 */
#define _CMU_CLKEN0_LESENSE_MASK                0x2000000UL                             /**< Bit mask for CMU_LESENSE                    */
#define _CMU_CLKEN0_LESENSE_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_LESENSE_DEFAULT              (_CMU_CLKEN0_LESENSE_DEFAULT << 25)     /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_GPIO                         (0x1UL << 26)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_GPIO_SHIFT                  26                                      /**< Shift value for CMU_GPIO                    */
#define _CMU_CLKEN0_GPIO_MASK                   0x4000000UL                             /**< Bit mask for CMU_GPIO                       */
#define _CMU_CLKEN0_GPIO_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_GPIO_DEFAULT                 (_CMU_CLKEN0_GPIO_DEFAULT << 26)        /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_PRS                          (0x1UL << 27)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_PRS_SHIFT                   27                                      /**< Shift value for CMU_PRS                     */
#define _CMU_CLKEN0_PRS_MASK                    0x8000000UL                             /**< Bit mask for CMU_PRS                        */
#define _CMU_CLKEN0_PRS_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_PRS_DEFAULT                  (_CMU_CLKEN0_PRS_DEFAULT << 27)         /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_BURAM                        (0x1UL << 28)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_BURAM_SHIFT                 28                                      /**< Shift value for CMU_BURAM                   */
#define _CMU_CLKEN0_BURAM_MASK                  0x10000000UL                            /**< Bit mask for CMU_BURAM                      */
#define _CMU_CLKEN0_BURAM_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_BURAM_DEFAULT                (_CMU_CLKEN0_BURAM_DEFAULT << 28)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_BURTC                        (0x1UL << 29)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_BURTC_SHIFT                 29                                      /**< Shift value for CMU_BURTC                   */
#define _CMU_CLKEN0_BURTC_MASK                  0x20000000UL                            /**< Bit mask for CMU_BURTC                      */
#define _CMU_CLKEN0_BURTC_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_BURTC_DEFAULT                (_CMU_CLKEN0_BURTC_DEFAULT << 29)       /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_SYSRTC0                      (0x1UL << 30)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_SYSRTC0_SHIFT               30                                      /**< Shift value for CMU_SYSRTC0                 */
#define _CMU_CLKEN0_SYSRTC0_MASK                0x40000000UL                            /**< Bit mask for CMU_SYSRTC0                    */
#define _CMU_CLKEN0_SYSRTC0_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_SYSRTC0_DEFAULT              (_CMU_CLKEN0_SYSRTC0_DEFAULT << 30)     /**< Shifted mode DEFAULT for CMU_CLKEN0         */
#define CMU_CLKEN0_DCDC                         (0x1UL << 31)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN0_DCDC_SHIFT                  31                                      /**< Shift value for CMU_DCDC                    */
#define _CMU_CLKEN0_DCDC_MASK                   0x80000000UL                            /**< Bit mask for CMU_DCDC                       */
#define _CMU_CLKEN0_DCDC_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN0                 */
#define CMU_CLKEN0_DCDC_DEFAULT                 (_CMU_CLKEN0_DCDC_DEFAULT << 31)        /**< Shifted mode DEFAULT for CMU_CLKEN0         */

