SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_cmu.h
/* Bit fields for CMU EM01GRPACLKCTRL */
#define _CMU_EM01GRPACLKCTRL_RESETVALUE         0x00000001UL                            /**< Default value for CMU_EM01GRPACLKCTRL       */
#define _CMU_EM01GRPACLKCTRL_MASK               0x00000007UL                            /**< Mask for CMU_EM01GRPACLKCTRL                */
#define _CMU_EM01GRPACLKCTRL_CLKSEL_SHIFT       0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_EM01GRPACLKCTRL_CLKSEL_MASK        0x7UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_EM01GRPACLKCTRL_CLKSEL_DEFAULT     0x00000001UL                            /**< Mode DEFAULT for CMU_EM01GRPACLKCTRL        */
#define _CMU_EM01GRPACLKCTRL_CLKSEL_HFRCODPLL   0x00000001UL                            /**< Mode HFRCODPLL for CMU_EM01GRPACLKCTRL      */
#define _CMU_EM01GRPACLKCTRL_CLKSEL_HFXO        0x00000002UL                            /**< Mode HFXO for CMU_EM01GRPACLKCTRL           */
#define _CMU_EM01GRPACLKCTRL_CLKSEL_FSRCO       0x00000003UL                            /**< Mode FSRCO for CMU_EM01GRPACLKCTRL          */
#define _CMU_EM01GRPACLKCTRL_CLKSEL_HFRCOEM23   0x00000004UL                            /**< Mode HFRCOEM23 for CMU_EM01GRPACLKCTRL      */
#define _CMU_EM01GRPACLKCTRL_CLKSEL_HFRCODPLLRT 0x00000005UL                            /**< Mode HFRCODPLLRT for CMU_EM01GRPACLKCTRL    */
#define _CMU_EM01GRPACLKCTRL_CLKSEL_HFXORT      0x00000006UL                            /**< Mode HFXORT for CMU_EM01GRPACLKCTRL         */
#define CMU_EM01GRPACLKCTRL_CLKSEL_DEFAULT      (_CMU_EM01GRPACLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_EM01GRPACLKCTRL*/
#define CMU_EM01GRPACLKCTRL_CLKSEL_HFRCODPLL    (_CMU_EM01GRPACLKCTRL_CLKSEL_HFRCODPLL << 0) /**< Shifted mode HFRCODPLL for CMU_EM01GRPACLKCTRL*/
#define CMU_EM01GRPACLKCTRL_CLKSEL_HFXO         (_CMU_EM01GRPACLKCTRL_CLKSEL_HFXO << 0) /**< Shifted mode HFXO for CMU_EM01GRPACLKCTRL   */
#define CMU_EM01GRPACLKCTRL_CLKSEL_FSRCO        (_CMU_EM01GRPACLKCTRL_CLKSEL_FSRCO << 0) /**< Shifted mode FSRCO for CMU_EM01GRPACLKCTRL  */
#define CMU_EM01GRPACLKCTRL_CLKSEL_HFRCOEM23    (_CMU_EM01GRPACLKCTRL_CLKSEL_HFRCOEM23 << 0) /**< Shifted mode HFRCOEM23 for CMU_EM01GRPACLKCTRL*/
#define CMU_EM01GRPACLKCTRL_CLKSEL_HFRCODPLLRT  (_CMU_EM01GRPACLKCTRL_CLKSEL_HFRCODPLLRT << 0) /**< Shifted mode HFRCODPLLRT for CMU_EM01GRPACLKCTRL*/
#define CMU_EM01GRPACLKCTRL_CLKSEL_HFXORT       (_CMU_EM01GRPACLKCTRL_CLKSEL_HFXORT << 0) /**< Shifted mode HFXORT for CMU_EM01GRPACLKCTRL */

/* Bit fields for CMU EM01GRPCCLKCTRL */
#define _CMU_EM01GRPCCLKCTRL_RESETVALUE         0x00000001UL                            /**< Default value for CMU_EM01GRPCCLKCTRL       */
#define _CMU_EM01GRPCCLKCTRL_MASK               0x00000007UL                            /**< Mask for CMU_EM01GRPCCLKCTRL                */
#define _CMU_EM01GRPCCLKCTRL_CLKSEL_SHIFT       0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_EM01GRPCCLKCTRL_CLKSEL_MASK        0x7UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_EM01GRPCCLKCTRL_CLKSEL_DEFAULT     0x00000001UL                            /**< Mode DEFAULT for CMU_EM01GRPCCLKCTRL        */
#define _CMU_EM01GRPCCLKCTRL_CLKSEL_HFRCODPLL   0x00000001UL                            /**< Mode HFRCODPLL for CMU_EM01GRPCCLKCTRL      */
#define _CMU_EM01GRPCCLKCTRL_CLKSEL_HFXO        0x00000002UL                            /**< Mode HFXO for CMU_EM01GRPCCLKCTRL           */
#define _CMU_EM01GRPCCLKCTRL_CLKSEL_FSRCO       0x00000003UL                            /**< Mode FSRCO for CMU_EM01GRPCCLKCTRL          */
#define _CMU_EM01GRPCCLKCTRL_CLKSEL_HFRCOEM23   0x00000004UL                            /**< Mode HFRCOEM23 for CMU_EM01GRPCCLKCTRL      */
#define _CMU_EM01GRPCCLKCTRL_CLKSEL_HFRCODPLLRT 0x00000005UL                            /**< Mode HFRCODPLLRT for CMU_EM01GRPCCLKCTRL    */
#define _CMU_EM01GRPCCLKCTRL_CLKSEL_HFXORT      0x00000006UL                            /**< Mode HFXORT for CMU_EM01GRPCCLKCTRL         */
#define CMU_EM01GRPCCLKCTRL_CLKSEL_DEFAULT      (_CMU_EM01GRPCCLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_EM01GRPCCLKCTRL*/
#define CMU_EM01GRPCCLKCTRL_CLKSEL_HFRCODPLL    (_CMU_EM01GRPCCLKCTRL_CLKSEL_HFRCODPLL << 0) /**< Shifted mode HFRCODPLL for CMU_EM01GRPCCLKCTRL*/
#define CMU_EM01GRPCCLKCTRL_CLKSEL_HFXO         (_CMU_EM01GRPCCLKCTRL_CLKSEL_HFXO << 0) /**< Shifted mode HFXO for CMU_EM01GRPCCLKCTRL   */
#define CMU_EM01GRPCCLKCTRL_CLKSEL_FSRCO        (_CMU_EM01GRPCCLKCTRL_CLKSEL_FSRCO << 0) /**< Shifted mode FSRCO for CMU_EM01GRPCCLKCTRL  */
#define CMU_EM01GRPCCLKCTRL_CLKSEL_HFRCOEM23    (_CMU_EM01GRPCCLKCTRL_CLKSEL_HFRCOEM23 << 0) /**< Shifted mode HFRCOEM23 for CMU_EM01GRPCCLKCTRL*/
#define CMU_EM01GRPCCLKCTRL_CLKSEL_HFRCODPLLRT  (_CMU_EM01GRPCCLKCTRL_CLKSEL_HFRCODPLLRT << 0) /**< Shifted mode HFRCODPLLRT for CMU_EM01GRPCCLKCTRL*/
#define CMU_EM01GRPCCLKCTRL_CLKSEL_HFXORT       (_CMU_EM01GRPCCLKCTRL_CLKSEL_HFXORT << 0) /**< Shifted mode HFXORT for CMU_EM01GRPCCLKCTRL */

/* Bit fields for CMU EM23GRPACLKCTRL */
#define _CMU_EM23GRPACLKCTRL_RESETVALUE         0x00000001UL                            /**< Default value for CMU_EM23GRPACLKCTRL       */
#define _CMU_EM23GRPACLKCTRL_MASK               0x00000003UL                            /**< Mask for CMU_EM23GRPACLKCTRL                */
#define _CMU_EM23GRPACLKCTRL_CLKSEL_SHIFT       0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_EM23GRPACLKCTRL_CLKSEL_MASK        0x3UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_EM23GRPACLKCTRL_CLKSEL_DEFAULT     0x00000001UL                            /**< Mode DEFAULT for CMU_EM23GRPACLKCTRL        */
#define _CMU_EM23GRPACLKCTRL_CLKSEL_LFRCO       0x00000001UL                            /**< Mode LFRCO for CMU_EM23GRPACLKCTRL          */
#define _CMU_EM23GRPACLKCTRL_CLKSEL_LFXO        0x00000002UL                            /**< Mode LFXO for CMU_EM23GRPACLKCTRL           */
#define _CMU_EM23GRPACLKCTRL_CLKSEL_ULFRCO      0x00000003UL                            /**< Mode ULFRCO for CMU_EM23GRPACLKCTRL         */
#define CMU_EM23GRPACLKCTRL_CLKSEL_DEFAULT      (_CMU_EM23GRPACLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_EM23GRPACLKCTRL*/
#define CMU_EM23GRPACLKCTRL_CLKSEL_LFRCO        (_CMU_EM23GRPACLKCTRL_CLKSEL_LFRCO << 0) /**< Shifted mode LFRCO for CMU_EM23GRPACLKCTRL  */
#define CMU_EM23GRPACLKCTRL_CLKSEL_LFXO         (_CMU_EM23GRPACLKCTRL_CLKSEL_LFXO << 0) /**< Shifted mode LFXO for CMU_EM23GRPACLKCTRL   */
#define CMU_EM23GRPACLKCTRL_CLKSEL_ULFRCO       (_CMU_EM23GRPACLKCTRL_CLKSEL_ULFRCO << 0) /**< Shifted mode ULFRCO for CMU_EM23GRPACLKCTRL */

/* Bit fields for CMU EM4GRPACLKCTRL */
#define _CMU_EM4GRPACLKCTRL_RESETVALUE          0x00000001UL                            /**< Default value for CMU_EM4GRPACLKCTRL        */
#define _CMU_EM4GRPACLKCTRL_MASK                0x00000003UL                            /**< Mask for CMU_EM4GRPACLKCTRL                 */
#define _CMU_EM4GRPACLKCTRL_CLKSEL_SHIFT        0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_EM4GRPACLKCTRL_CLKSEL_MASK         0x3UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_EM4GRPACLKCTRL_CLKSEL_DEFAULT      0x00000001UL                            /**< Mode DEFAULT for CMU_EM4GRPACLKCTRL         */
#define _CMU_EM4GRPACLKCTRL_CLKSEL_LFRCO        0x00000001UL                            /**< Mode LFRCO for CMU_EM4GRPACLKCTRL           */
#define _CMU_EM4GRPACLKCTRL_CLKSEL_LFXO         0x00000002UL                            /**< Mode LFXO for CMU_EM4GRPACLKCTRL            */
#define _CMU_EM4GRPACLKCTRL_CLKSEL_ULFRCO       0x00000003UL                            /**< Mode ULFRCO for CMU_EM4GRPACLKCTRL          */
#define CMU_EM4GRPACLKCTRL_CLKSEL_DEFAULT       (_CMU_EM4GRPACLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_EM4GRPACLKCTRL */
#define CMU_EM4GRPACLKCTRL_CLKSEL_LFRCO         (_CMU_EM4GRPACLKCTRL_CLKSEL_LFRCO << 0) /**< Shifted mode LFRCO for CMU_EM4GRPACLKCTRL   */
#define CMU_EM4GRPACLKCTRL_CLKSEL_LFXO          (_CMU_EM4GRPACLKCTRL_CLKSEL_LFXO << 0)  /**< Shifted mode LFXO for CMU_EM4GRPACLKCTRL    */
#define CMU_EM4GRPACLKCTRL_CLKSEL_ULFRCO        (_CMU_EM4GRPACLKCTRL_CLKSEL_ULFRCO << 0) /**< Shifted mode ULFRCO for CMU_EM4GRPACLKCTRL  */

/* Bit fields for CMU IADCCLKCTRL */
#define _CMU_IADCCLKCTRL_RESETVALUE             0x00000001UL                            /**< Default value for CMU_IADCCLKCTRL           */
#define _CMU_IADCCLKCTRL_MASK                   0x00000003UL                            /**< Mask for CMU_IADCCLKCTRL                    */
#define _CMU_IADCCLKCTRL_CLKSEL_SHIFT           0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_IADCCLKCTRL_CLKSEL_MASK            0x3UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_IADCCLKCTRL_CLKSEL_DEFAULT         0x00000001UL                            /**< Mode DEFAULT for CMU_IADCCLKCTRL            */
#define _CMU_IADCCLKCTRL_CLKSEL_EM01GRPACLK     0x00000001UL                            /**< Mode EM01GRPACLK for CMU_IADCCLKCTRL        */
#define _CMU_IADCCLKCTRL_CLKSEL_FSRCO           0x00000002UL                            /**< Mode FSRCO for CMU_IADCCLKCTRL              */
#define _CMU_IADCCLKCTRL_CLKSEL_HFRCOEM23       0x00000003UL                            /**< Mode HFRCOEM23 for CMU_IADCCLKCTRL          */
#define CMU_IADCCLKCTRL_CLKSEL_DEFAULT          (_CMU_IADCCLKCTRL_CLKSEL_DEFAULT << 0)  /**< Shifted mode DEFAULT for CMU_IADCCLKCTRL    */
#define CMU_IADCCLKCTRL_CLKSEL_EM01GRPACLK      (_CMU_IADCCLKCTRL_CLKSEL_EM01GRPACLK << 0) /**< Shifted mode EM01GRPACLK for CMU_IADCCLKCTRL*/
#define CMU_IADCCLKCTRL_CLKSEL_FSRCO            (_CMU_IADCCLKCTRL_CLKSEL_FSRCO << 0)    /**< Shifted mode FSRCO for CMU_IADCCLKCTRL      */
#define CMU_IADCCLKCTRL_CLKSEL_HFRCOEM23        (_CMU_IADCCLKCTRL_CLKSEL_HFRCOEM23 << 0) /**< Shifted mode HFRCOEM23 for CMU_IADCCLKCTRL  */

/* Bit fields for CMU WDOG0CLKCTRL */
#define _CMU_WDOG0CLKCTRL_RESETVALUE            0x00000001UL                            /**< Default value for CMU_WDOG0CLKCTRL          */
#define _CMU_WDOG0CLKCTRL_MASK                  0x00000007UL                            /**< Mask for CMU_WDOG0CLKCTRL                   */
#define _CMU_WDOG0CLKCTRL_CLKSEL_SHIFT          0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_WDOG0CLKCTRL_CLKSEL_MASK           0x7UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_WDOG0CLKCTRL_CLKSEL_DEFAULT        0x00000001UL                            /**< Mode DEFAULT for CMU_WDOG0CLKCTRL           */
#define _CMU_WDOG0CLKCTRL_CLKSEL_LFRCO          0x00000001UL                            /**< Mode LFRCO for CMU_WDOG0CLKCTRL             */
#define _CMU_WDOG0CLKCTRL_CLKSEL_LFXO           0x00000002UL                            /**< Mode LFXO for CMU_WDOG0CLKCTRL              */
#define _CMU_WDOG0CLKCTRL_CLKSEL_ULFRCO         0x00000003UL                            /**< Mode ULFRCO for CMU_WDOG0CLKCTRL            */
#define _CMU_WDOG0CLKCTRL_CLKSEL_HCLKDIV1024    0x00000004UL                            /**< Mode HCLKDIV1024 for CMU_WDOG0CLKCTRL       */
#define CMU_WDOG0CLKCTRL_CLKSEL_DEFAULT         (_CMU_WDOG0CLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_WDOG0CLKCTRL   */
#define CMU_WDOG0CLKCTRL_CLKSEL_LFRCO           (_CMU_WDOG0CLKCTRL_CLKSEL_LFRCO << 0)   /**< Shifted mode LFRCO for CMU_WDOG0CLKCTRL     */
#define CMU_WDOG0CLKCTRL_CLKSEL_LFXO            (_CMU_WDOG0CLKCTRL_CLKSEL_LFXO << 0)    /**< Shifted mode LFXO for CMU_WDOG0CLKCTRL      */
#define CMU_WDOG0CLKCTRL_CLKSEL_ULFRCO          (_CMU_WDOG0CLKCTRL_CLKSEL_ULFRCO << 0)  /**< Shifted mode ULFRCO for CMU_WDOG0CLKCTRL    */
#define CMU_WDOG0CLKCTRL_CLKSEL_HCLKDIV1024     (_CMU_WDOG0CLKCTRL_CLKSEL_HCLKDIV1024 << 0) /**< Shifted mode HCLKDIV1024 for CMU_WDOG0CLKCTRL*/

/* Bit fields for CMU WDOG1CLKCTRL */
#define _CMU_WDOG1CLKCTRL_RESETVALUE            0x00000001UL                            /**< Default value for CMU_WDOG1CLKCTRL          */
#define _CMU_WDOG1CLKCTRL_MASK                  0x00000007UL                            /**< Mask for CMU_WDOG1CLKCTRL                   */
#define _CMU_WDOG1CLKCTRL_CLKSEL_SHIFT          0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_WDOG1CLKCTRL_CLKSEL_MASK           0x7UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_WDOG1CLKCTRL_CLKSEL_DEFAULT        0x00000001UL                            /**< Mode DEFAULT for CMU_WDOG1CLKCTRL           */
#define _CMU_WDOG1CLKCTRL_CLKSEL_LFRCO          0x00000001UL                            /**< Mode LFRCO for CMU_WDOG1CLKCTRL             */
#define _CMU_WDOG1CLKCTRL_CLKSEL_LFXO           0x00000002UL                            /**< Mode LFXO for CMU_WDOG1CLKCTRL              */
#define _CMU_WDOG1CLKCTRL_CLKSEL_ULFRCO         0x00000003UL                            /**< Mode ULFRCO for CMU_WDOG1CLKCTRL            */
#define _CMU_WDOG1CLKCTRL_CLKSEL_HCLKDIV1024    0x00000004UL                            /**< Mode HCLKDIV1024 for CMU_WDOG1CLKCTRL       */
#define CMU_WDOG1CLKCTRL_CLKSEL_DEFAULT         (_CMU_WDOG1CLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_WDOG1CLKCTRL   */
#define CMU_WDOG1CLKCTRL_CLKSEL_LFRCO           (_CMU_WDOG1CLKCTRL_CLKSEL_LFRCO << 0)   /**< Shifted mode LFRCO for CMU_WDOG1CLKCTRL     */
#define CMU_WDOG1CLKCTRL_CLKSEL_LFXO            (_CMU_WDOG1CLKCTRL_CLKSEL_LFXO << 0)    /**< Shifted mode LFXO for CMU_WDOG1CLKCTRL      */
#define CMU_WDOG1CLKCTRL_CLKSEL_ULFRCO          (_CMU_WDOG1CLKCTRL_CLKSEL_ULFRCO << 0)  /**< Shifted mode ULFRCO for CMU_WDOG1CLKCTRL    */
#define CMU_WDOG1CLKCTRL_CLKSEL_HCLKDIV1024     (_CMU_WDOG1CLKCTRL_CLKSEL_HCLKDIV1024 << 0) /**< Shifted mode HCLKDIV1024 for CMU_WDOG1CLKCTRL*/

/* Bit fields for CMU EUSART0CLKCTRL */
#define _CMU_EUSART0CLKCTRL_RESETVALUE          0x00000001UL                            /**< Default value for CMU_EUSART0CLKCTRL        */
#define _CMU_EUSART0CLKCTRL_MASK                0x00000007UL                            /**< Mask for CMU_EUSART0CLKCTRL                 */
#define _CMU_EUSART0CLKCTRL_CLKSEL_SHIFT        0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_EUSART0CLKCTRL_CLKSEL_MASK         0x7UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_EUSART0CLKCTRL_CLKSEL_DEFAULT      0x00000001UL                            /**< Mode DEFAULT for CMU_EUSART0CLKCTRL         */
#define _CMU_EUSART0CLKCTRL_CLKSEL_DISABLED     0x00000000UL                            /**< Mode DISABLED for CMU_EUSART0CLKCTRL        */
#define _CMU_EUSART0CLKCTRL_CLKSEL_EM01GRPCCLK  0x00000001UL                            /**< Mode EM01GRPCCLK for CMU_EUSART0CLKCTRL     */
#define _CMU_EUSART0CLKCTRL_CLKSEL_HFRCOEM23    0x00000002UL                            /**< Mode HFRCOEM23 for CMU_EUSART0CLKCTRL       */
#define _CMU_EUSART0CLKCTRL_CLKSEL_LFRCO        0x00000003UL                            /**< Mode LFRCO for CMU_EUSART0CLKCTRL           */
#define _CMU_EUSART0CLKCTRL_CLKSEL_LFXO         0x00000004UL                            /**< Mode LFXO for CMU_EUSART0CLKCTRL            */
#define CMU_EUSART0CLKCTRL_CLKSEL_DEFAULT       (_CMU_EUSART0CLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_EUSART0CLKCTRL */
#define CMU_EUSART0CLKCTRL_CLKSEL_DISABLED      (_CMU_EUSART0CLKCTRL_CLKSEL_DISABLED << 0) /**< Shifted mode DISABLED for CMU_EUSART0CLKCTRL*/
#define CMU_EUSART0CLKCTRL_CLKSEL_EM01GRPCCLK   (_CMU_EUSART0CLKCTRL_CLKSEL_EM01GRPCCLK << 0) /**< Shifted mode EM01GRPCCLK for CMU_EUSART0CLKCTRL*/
#define CMU_EUSART0CLKCTRL_CLKSEL_HFRCOEM23     (_CMU_EUSART0CLKCTRL_CLKSEL_HFRCOEM23 << 0) /**< Shifted mode HFRCOEM23 for CMU_EUSART0CLKCTRL*/
#define CMU_EUSART0CLKCTRL_CLKSEL_LFRCO         (_CMU_EUSART0CLKCTRL_CLKSEL_LFRCO << 0) /**< Shifted mode LFRCO for CMU_EUSART0CLKCTRL   */
#define CMU_EUSART0CLKCTRL_CLKSEL_LFXO          (_CMU_EUSART0CLKCTRL_CLKSEL_LFXO << 0)  /**< Shifted mode LFXO for CMU_EUSART0CLKCTRL    */

/* Bit fields for CMU SYSRTC0CLKCTRL */
#define _CMU_SYSRTC0CLKCTRL_RESETVALUE          0x00000001UL                            /**< Default value for CMU_SYSRTC0CLKCTRL        */
#define _CMU_SYSRTC0CLKCTRL_MASK                0x00000003UL                            /**< Mask for CMU_SYSRTC0CLKCTRL                 */
#define _CMU_SYSRTC0CLKCTRL_CLKSEL_SHIFT        0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_SYSRTC0CLKCTRL_CLKSEL_MASK         0x3UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_SYSRTC0CLKCTRL_CLKSEL_DEFAULT      0x00000001UL                            /**< Mode DEFAULT for CMU_SYSRTC0CLKCTRL         */
#define _CMU_SYSRTC0CLKCTRL_CLKSEL_LFRCO        0x00000001UL                            /**< Mode LFRCO for CMU_SYSRTC0CLKCTRL           */
#define _CMU_SYSRTC0CLKCTRL_CLKSEL_LFXO         0x00000002UL                            /**< Mode LFXO for CMU_SYSRTC0CLKCTRL            */
#define _CMU_SYSRTC0CLKCTRL_CLKSEL_ULFRCO       0x00000003UL                            /**< Mode ULFRCO for CMU_SYSRTC0CLKCTRL          */
#define CMU_SYSRTC0CLKCTRL_CLKSEL_DEFAULT       (_CMU_SYSRTC0CLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_SYSRTC0CLKCTRL */
#define CMU_SYSRTC0CLKCTRL_CLKSEL_LFRCO         (_CMU_SYSRTC0CLKCTRL_CLKSEL_LFRCO << 0) /**< Shifted mode LFRCO for CMU_SYSRTC0CLKCTRL   */
#define CMU_SYSRTC0CLKCTRL_CLKSEL_LFXO          (_CMU_SYSRTC0CLKCTRL_CLKSEL_LFXO << 0)  /**< Shifted mode LFXO for CMU_SYSRTC0CLKCTRL    */
#define CMU_SYSRTC0CLKCTRL_CLKSEL_ULFRCO        (_CMU_SYSRTC0CLKCTRL_CLKSEL_ULFRCO << 0) /**< Shifted mode ULFRCO for CMU_SYSRTC0CLKCTRL  */

/* Bit fields for CMU LCDCLKCTRL */
#define _CMU_LCDCLKCTRL_RESETVALUE              0x00000001UL                            /**< Default value for CMU_LCDCLKCTRL            */
#define _CMU_LCDCLKCTRL_MASK                    0x00000003UL                            /**< Mask for CMU_LCDCLKCTRL                     */
#define _CMU_LCDCLKCTRL_CLKSEL_SHIFT            0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_LCDCLKCTRL_CLKSEL_MASK             0x3UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_LCDCLKCTRL_CLKSEL_DEFAULT          0x00000001UL                            /**< Mode DEFAULT for CMU_LCDCLKCTRL             */
#define _CMU_LCDCLKCTRL_CLKSEL_LFRCO            0x00000001UL                            /**< Mode LFRCO for CMU_LCDCLKCTRL               */
#define _CMU_LCDCLKCTRL_CLKSEL_LFXO             0x00000002UL                            /**< Mode LFXO for CMU_LCDCLKCTRL                */
#define _CMU_LCDCLKCTRL_CLKSEL_ULFRCO           0x00000003UL                            /**< Mode ULFRCO for CMU_LCDCLKCTRL              */
#define CMU_LCDCLKCTRL_CLKSEL_DEFAULT           (_CMU_LCDCLKCTRL_CLKSEL_DEFAULT << 0)   /**< Shifted mode DEFAULT for CMU_LCDCLKCTRL     */
#define CMU_LCDCLKCTRL_CLKSEL_LFRCO             (_CMU_LCDCLKCTRL_CLKSEL_LFRCO << 0)     /**< Shifted mode LFRCO for CMU_LCDCLKCTRL       */
#define CMU_LCDCLKCTRL_CLKSEL_LFXO              (_CMU_LCDCLKCTRL_CLKSEL_LFXO << 0)      /**< Shifted mode LFXO for CMU_LCDCLKCTRL        */
#define CMU_LCDCLKCTRL_CLKSEL_ULFRCO            (_CMU_LCDCLKCTRL_CLKSEL_ULFRCO << 0)    /**< Shifted mode ULFRCO for CMU_LCDCLKCTRL      */

/* Bit fields for CMU VDAC0CLKCTRL */
#define _CMU_VDAC0CLKCTRL_RESETVALUE            0x00000001UL                            /**< Default value for CMU_VDAC0CLKCTRL          */
#define _CMU_VDAC0CLKCTRL_MASK                  0x00000007UL                            /**< Mask for CMU_VDAC0CLKCTRL                   */
#define _CMU_VDAC0CLKCTRL_CLKSEL_SHIFT          0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_VDAC0CLKCTRL_CLKSEL_MASK           0x7UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_VDAC0CLKCTRL_CLKSEL_DEFAULT        0x00000001UL                            /**< Mode DEFAULT for CMU_VDAC0CLKCTRL           */
#define _CMU_VDAC0CLKCTRL_CLKSEL_DISABLED       0x00000000UL                            /**< Mode DISABLED for CMU_VDAC0CLKCTRL          */
#define _CMU_VDAC0CLKCTRL_CLKSEL_EM01GRPACLK    0x00000001UL                            /**< Mode EM01GRPACLK for CMU_VDAC0CLKCTRL       */
#define _CMU_VDAC0CLKCTRL_CLKSEL_EM23GRPACLK    0x00000002UL                            /**< Mode EM23GRPACLK for CMU_VDAC0CLKCTRL       */
#define _CMU_VDAC0CLKCTRL_CLKSEL_FSRCO          0x00000003UL                            /**< Mode FSRCO for CMU_VDAC0CLKCTRL             */
#define _CMU_VDAC0CLKCTRL_CLKSEL_HFRCOEM23      0x00000004UL                            /**< Mode HFRCOEM23 for CMU_VDAC0CLKCTRL         */
#define CMU_VDAC0CLKCTRL_CLKSEL_DEFAULT         (_CMU_VDAC0CLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_VDAC0CLKCTRL   */
#define CMU_VDAC0CLKCTRL_CLKSEL_DISABLED        (_CMU_VDAC0CLKCTRL_CLKSEL_DISABLED << 0) /**< Shifted mode DISABLED for CMU_VDAC0CLKCTRL  */
#define CMU_VDAC0CLKCTRL_CLKSEL_EM01GRPACLK     (_CMU_VDAC0CLKCTRL_CLKSEL_EM01GRPACLK << 0) /**< Shifted mode EM01GRPACLK for CMU_VDAC0CLKCTRL*/
#define CMU_VDAC0CLKCTRL_CLKSEL_EM23GRPACLK     (_CMU_VDAC0CLKCTRL_CLKSEL_EM23GRPACLK << 0) /**< Shifted mode EM23GRPACLK for CMU_VDAC0CLKCTRL*/
#define CMU_VDAC0CLKCTRL_CLKSEL_FSRCO           (_CMU_VDAC0CLKCTRL_CLKSEL_FSRCO << 0)   /**< Shifted mode FSRCO for CMU_VDAC0CLKCTRL     */
#define CMU_VDAC0CLKCTRL_CLKSEL_HFRCOEM23       (_CMU_VDAC0CLKCTRL_CLKSEL_HFRCOEM23 << 0) /**< Shifted mode HFRCOEM23 for CMU_VDAC0CLKCTRL */

