SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_cmu.h
/* Bit fields for CMU PCNT0CLKCTRL */
#define _CMU_PCNT0CLKCTRL_RESETVALUE            0x00000001UL                            /**< Default value for CMU_PCNT0CLKCTRL          */
#define _CMU_PCNT0CLKCTRL_MASK                  0x00000003UL                            /**< Mask for CMU_PCNT0CLKCTRL                   */
#define _CMU_PCNT0CLKCTRL_CLKSEL_SHIFT          0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_PCNT0CLKCTRL_CLKSEL_MASK           0x3UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_PCNT0CLKCTRL_CLKSEL_DEFAULT        0x00000001UL                            /**< Mode DEFAULT for CMU_PCNT0CLKCTRL           */
#define _CMU_PCNT0CLKCTRL_CLKSEL_DISABLED       0x00000000UL                            /**< Mode DISABLED for CMU_PCNT0CLKCTRL          */
#define _CMU_PCNT0CLKCTRL_CLKSEL_EM23GRPACLK    0x00000001UL                            /**< Mode EM23GRPACLK for CMU_PCNT0CLKCTRL       */
#define _CMU_PCNT0CLKCTRL_CLKSEL_PCNTS0         0x00000002UL                            /**< Mode PCNTS0 for CMU_PCNT0CLKCTRL            */
#define CMU_PCNT0CLKCTRL_CLKSEL_DEFAULT         (_CMU_PCNT0CLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_PCNT0CLKCTRL   */
#define CMU_PCNT0CLKCTRL_CLKSEL_DISABLED        (_CMU_PCNT0CLKCTRL_CLKSEL_DISABLED << 0) /**< Shifted mode DISABLED for CMU_PCNT0CLKCTRL  */
#define CMU_PCNT0CLKCTRL_CLKSEL_EM23GRPACLK     (_CMU_PCNT0CLKCTRL_CLKSEL_EM23GRPACLK << 0) /**< Shifted mode EM23GRPACLK for CMU_PCNT0CLKCTRL*/
#define CMU_PCNT0CLKCTRL_CLKSEL_PCNTS0          (_CMU_PCNT0CLKCTRL_CLKSEL_PCNTS0 << 0)  /**< Shifted mode PCNTS0 for CMU_PCNT0CLKCTRL    */

/* Bit fields for CMU RADIOCLKCTRL */
#define _CMU_RADIOCLKCTRL_RESETVALUE            0x00000000UL                            /**< Default value for CMU_RADIOCLKCTRL          */
#define _CMU_RADIOCLKCTRL_MASK                  0x80000003UL                            /**< Mask for CMU_RADIOCLKCTRL                   */
#define CMU_RADIOCLKCTRL_EN                     (0x1UL << 0)                            /**< Enable                                      */
#define _CMU_RADIOCLKCTRL_EN_SHIFT              0                                       /**< Shift value for CMU_EN                      */
#define _CMU_RADIOCLKCTRL_EN_MASK               0x1UL                                   /**< Bit mask for CMU_EN                         */
#define _CMU_RADIOCLKCTRL_EN_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for CMU_RADIOCLKCTRL           */
#define CMU_RADIOCLKCTRL_EN_DEFAULT             (_CMU_RADIOCLKCTRL_EN_DEFAULT << 0)     /**< Shifted mode DEFAULT for CMU_RADIOCLKCTRL   */
#define CMU_RADIOCLKCTRL_DBGCLK                 (0x1UL << 31)                           /**< Enable Clock for Debugger                   */
#define _CMU_RADIOCLKCTRL_DBGCLK_SHIFT          31                                      /**< Shift value for CMU_DBGCLK                  */
#define _CMU_RADIOCLKCTRL_DBGCLK_MASK           0x80000000UL                            /**< Bit mask for CMU_DBGCLK                     */
#define _CMU_RADIOCLKCTRL_DBGCLK_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for CMU_RADIOCLKCTRL           */
#define CMU_RADIOCLKCTRL_DBGCLK_DEFAULT         (_CMU_RADIOCLKCTRL_DBGCLK_DEFAULT << 31) /**< Shifted mode DEFAULT for CMU_RADIOCLKCTRL   */

/* Bit fields for CMU LESENSEHFCLKCTRL */
#define _CMU_LESENSEHFCLKCTRL_RESETVALUE        0x00000001UL                            /**< Default value for CMU_LESENSEHFCLKCTRL      */
#define _CMU_LESENSEHFCLKCTRL_MASK              0x00000003UL                            /**< Mask for CMU_LESENSEHFCLKCTRL               */
#define _CMU_LESENSEHFCLKCTRL_CLKSEL_SHIFT      0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_LESENSEHFCLKCTRL_CLKSEL_MASK       0x3UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_LESENSEHFCLKCTRL_CLKSEL_DEFAULT    0x00000001UL                            /**< Mode DEFAULT for CMU_LESENSEHFCLKCTRL       */
#define _CMU_LESENSEHFCLKCTRL_CLKSEL_FSRCO      0x00000001UL                            /**< Mode FSRCO for CMU_LESENSEHFCLKCTRL         */
#define _CMU_LESENSEHFCLKCTRL_CLKSEL_HFRCOEM23  0x00000002UL                            /**< Mode HFRCOEM23 for CMU_LESENSEHFCLKCTRL     */
#define CMU_LESENSEHFCLKCTRL_CLKSEL_DEFAULT     (_CMU_LESENSEHFCLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_LESENSEHFCLKCTRL*/
#define CMU_LESENSEHFCLKCTRL_CLKSEL_FSRCO       (_CMU_LESENSEHFCLKCTRL_CLKSEL_FSRCO << 0) /**< Shifted mode FSRCO for CMU_LESENSEHFCLKCTRL */
#define CMU_LESENSEHFCLKCTRL_CLKSEL_HFRCOEM23   (_CMU_LESENSEHFCLKCTRL_CLKSEL_HFRCOEM23 << 0) /**< Shifted mode HFRCOEM23 for CMU_LESENSEHFCLKCTRL*/

/** @} End of group EFR32SG23_CMU_BitFields */
/** @} End of group EFR32SG23_CMU */
/** @} End of group Parts */

#endif // EFR32SG23_CMU_H
